УправДом/src/Documents/УстановкаПервичныхДанныхГазоснабжения/УстановкаПервичныхДанныхГазоснабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаПервичныхДанныхГазоснабжения</name>
  <registerRecords>InformationRegister.СведенияПоПлатежам</registerRecords>
  <registerRecords>AccumulationRegister.ПотреблениеКомунальныхУслуг</registerRecords>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийОплаченныйМесяц</name>
    <type>
      <types>EnumRef.МесяцыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийОплаченныйПериодСлужебный</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачальныеПоказания</name>
    <attributes>
      <name>КрайниеПереданныеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайниеОплаченныеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправДом/src/Documents/УстановкаПервичныхДанныхГазоснабжения/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
//	Если Объект.НачальныеПоказания.Количество() = 0 Тогда
//		Элементы.НачальныеПоказания.ДобавитьСтроку();
//	КонецЕсли;
	ПриОткрытииНаСервере();
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КрайнийОплаченныйМесяцПриИзменении(Элемент)
	ВыбранныйМесяц = Объект.КрайнийОплаченныйМесяц;
	ВыбранныйГод = Объект.ГодПлатежа;
	
	СлужебнаяДата = РаботаСДокументамиСерверУД.РассчитатьСлужебнуюДату(ВыбранныйМесяц, ВыбранныйГод);
	Объект.КрайнийОплаченныйПериодСлужебный = СлужебнаяДата;
КонецПроцедуры

&НаКлиенте
Процедура ГодПлатежаПриИзменении(Элемент)
	ВыбранныйМесяц = Объект.КрайнийОплаченныйМесяц;
	ВыбранныйГод = Объект.ГодПлатежа;
	
	СлужебнаяДата = РаботаСДокументамиСерверУД.РассчитатьСлужебнуюДату(ВыбранныйМесяц, ВыбранныйГод);
	Объект.КрайнийОплаченныйПериодСлужебный = СлужебнаяДата;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ГодПлатежа = Год(ТекущаяДатаСеанса());
//	КонецЕсли;
	
//	Если Объект.НачальныеПоказания.Количество() = 0 Тогда
		Объект.НачальныеПоказания.Добавить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
